# Текст за търсене на букви:
mytext=input("Въведете текст за проверка: ")
# Букви за търсене:
symbs=['а','у','я']
print("Търсим следните букви:",symbs)
# Търсене на букви:
for s in symbs:
    # Ако е намерена буква:
    if s in mytext:
        print("В текста има буква '"+s+"'")
        # Край на оператора за цикъл:
        break
    # Ако такава буква няма:
    else:
        print("В текста няма буква '"+s+"'")
# Блок else на оператора за цикъл:
else:
    print("Такива букви в текста няма")
# Последно съобщение на програмата:
print("Търсенето приключи")
