# Прочитане на горната граница на сумата:
n = int(input("Посочете горната граница на сумата: "))
# Начална стойност за сумата:
s = 0
# Начална стойност на индексната променлива:
k = 0
# Оператор за цикъл за изчисление на сумата:
while k < n:
    # Увеличаване стойността на индексната променлива с
    # единица:
    k = k + 1
    # Прибавяне на слагаемо към сумата:
    s = s + k
# Показване на резултата:
print("Сумата на числата от 1 до", n, "е равна на", s)
print(f"Сумата на числата от 1 до {k} е равна на {s}")
