# Включване на функция за генериране на случайни числа:
from random import *
# Инициализация на генератора на случайни числа:
seed(2019)
# Създаване на списък от случайни числа:
A=[randint(10,20) for k in range(15)]
# Съдържание на списъка:
print("A:",A)
# Изброяване на елементите с различни стойности:
for a in range(min(A),max(A)+1):
    print(a,"-",A.count(a))
# Най-голяма, най-малка и средна стойност:
print("Най-малка:")
print("A[",A.index(min(A)),"]=",min(A),sep="")
print("Най-голяма:")
print("A[",A.index(max(A)),"]=",max(A),sep="")
print("Средна:",sum(A)/len(A))
# Сортиране на списъка:
B=sorted(A)
A.sort(reverse=True)
# Проверка на съдържанието на списъците:
print("A:",A)
print("B:",B)
