# Създаване на кортежи:
A=(10,20,30)
print("A:",A)
B=("Python",(1,2))
print("B:",B)
# Изчисление на сума на кортежи:
C=A+B
print("C:",C)
# "Добавяне" на елемент в края на кортежа:
C+=(100,)
print("C:",C)
# "Изтриване" на елемент от кортежа:
C=C[:1]+C[2:]
print("C:",C)
# "Добавяне" на елемент в началото на кортежа:
C=(200,)+C
print("C:",C)
# "Замяна" на няколко елемента в кортежа:
C=("A","B")+C[3:]
print("C:",C)
# "Вмъкване" на елементи в кортежа:
C=C[:2]+(8,9)+C[2:]
print("C:",C)
# "Присвояване" на стойност на елемент от кортежа:
C=C[:2]+(7,)+C[3:]
print("C:",C)
