num=10
# Функция на основата на ламбда-израз:
L=lambda n: 2*n+1
# Проверка на резултата:
print("Нечетни числа:")
for k in range(num):
    print(L(k),end=" ")
# Нова стойност:
L=lambda n: 2**n
# Проверка на резултата:
print("\nСтепени на двойката:")
for k in range(num):
    print(L(k),end=" ")
# Директно извикване на ламбда-функция:
print("\nКвадрати на числата:")
for k in range(num):
    print((lambda x: x*x)(k+1),end=" ")
# Обикновена функция:
def calc(x,y):
    return x+y
# Използване на функция в ламбда-израз:
F=lambda x,y: calc(x,y)
# На променлива се присвоява име на функция:
f=calc
# На името на функция се присвоява ламбда-израз:
calc=lambda x,y: x*y
# Проверка на резултата:
print("\nИзвикване на F(3,5):",F(3,5))
print("Извикване на f(3,5):",f(3,5))
print("Извикване на calc(3,5):",calc(3,5))
