print("Започва копиране на файла")
# Контролируем код:
try:
    # Отваряме бинарен файл за четене:
    A=open("Н:\\Book\\animal.jpg","rb")
    # Създаване на бинарен файл:
    B=open("Н:\\Book\\Python\\bear.jpg","xb")
    # Четене съдържанието на първия файл
    # и записване във втория:
    B.write(A.read())
    # Затваряне на файловете:
    A.close()
    B.close()
    print("Копирането протече успешно")
# Ако вторият файл вече съществува:
except FileExistsError:
    print("Грешка: такъв файл вече съществува")
# Всички други грешки:
except:
    print("Грешка при достъпа до файла")
print("Изпълнението на програмата завърши")
