# Отваряме текстовия файл за четене:
mf=open("Н:\\Book\\Python\\poetry.txt")
# Променлива за номерация на редовете:
k=1
# Четене на файла ред по ред:
print("Четене на файла ред по ред")
L=mf.readline()
while L!="":
    # Показване на номера на реда:
    print("["+str(k)+"] ",end="")
    # Показване на символите на реда:
    for s in L:
        # Замяна на интервала със знак за подчертаване:
        if s==' ':
            s='_'
        print(s,end="")
    # Нова стойност за номера на реда:
    k+=1
    # Прочитане на нов ред:
    L=mf.readline()
# Затваряме файла:
mf.close()
print("\nФайлът е затворен...")
