# Изходен текст:
txt=input("Въведете текст: ")
# Преобразуване в долен регистър:
txt=txt.lower()
# Резултат от преобразуването: 
print(txt)
# Разбивка на текста на поднизове:
L=txt.split(" ")
# Резултат от разбивката:
print(L)
# Променливи:
s=0
n=0
# Обхождане на елементите на списъка:
for k in range(len(L)):
    # Отхвърляме небуквените символи:
    w=L[k].strip(".,:;-!?")
    # Ако текстът не е празен:
    if len(w)!=0:
       # Показване на думата и дължината ѝ:
       print(w.ljust(12),"-",len(w))
       # Сума на буквите в думата:
       s+=len(w)
       # Брой думи:
       n+=1
# Средна стойност:
s/=n
# Резултат от изчисленията:
print("Средна дължина:",s)
