# Текстов литерал без префикс:
A="\"Java\"\n\"Python\""
print(A)
print("Символи:",len(A))
# Текстов литерал с префикс:
B=r"\"Java\"\n\"Python\""
print(B)
print("Символи:",len(B))
# Променлива с текстова стойност:
name="Python"
# Текстов литерал с префикс:
C=f"Езикът {name} е прост и разбираем"
print(C)
C=f"Езикът {name!r} е прост и разбираем "
print(C)
# Променлива с числова стойност:
num=12.34567
# Текстов литерал с префикс:
txt=f"Число: {num:9.3f}"
print(txt)
txt=f"Число: {num:09.3f}"
print(txt)
# Нова числова стойност на променливата:
num=42
# Формат за показване на цяло число:
txt=f"Число: {num:*>9d}"
print(txt)
# Формат за показване на шестнайсетично число:
txt=f"Число: {num:#09x}"
print(txt)
txt=f"Число: {num:9x}"
print(txt)
txt=f"Число: {num:*<9x}"
print(txt)
# Формат за показване на осмично число:
txt=f"Число: {num:*^#09o}"
print(txt)
# Формат за показване на двоично число:
txt=f"Число: {num:#9b}"
print(txt)
