# Размер на списъка:
n = 10
# Начална стойност за списъка:
A = [1, 1]
# Запълване на списъка:
for k in range(n - 2):
    A.append(A[-1] + A[-2])
# Проверка на съдържанието на списъка:
print("A:", A)
# Изменение на реда на елементите в списъка:
for k in range(len(A) - 1):
    A.append(A.pop(-k - 2))
# Проверка на съдържанието на списъка:
print("A:", A)
# Изтриване на най-големия елемент в списъка:
A.remove(max(A))
# Проверка на съдържанието на списъка:
print("A:", A)
# Изтриване на най-малкия елемент в списъка:
A.remove(min(A))
# Проверка на съдържанието на списъка:
print("A:", A)
# Добавяне на елемент в началото на списъка:
A.insert(0, A[0] + A[1])
# Проверка на съдържанието на списъка:
print("A:", A)
# Празен списък:
B = []
# Част от елементите на единия списък се пренасят в другия:
for k in range(len(A) // 2):
    B.insert(0, A.pop(-1))
# Проверка на съдържанието на списъка:
print("A:", A)
print("B:", B)
# Добавяне на елемент в края на списъка:
A.append(B)
# Проверка на съдържанието на списъка:
print("A:", A)
# Изтриване на последния елемент в списъка:
A.pop(-1)
# Проверка на съдържанието на списъка:
print("A:", A)
# Добавяне на елемент в списъка:
A.extend(B)
# Проверка на съдържанието на списъка:
print("A:", A)
