# Въвеждане на параметрите на уравнението:
a,b=eval(input("Въведете (чрез запетая) две числа: "))
# Проверка на типа на въведените параметри:
if (type(a)==int or type(a)==float) and (type(b)==int or type(b)==float):
    print("Уравнение "+str(a)+"x="+str(b))
    # Ако първият параметър е ненулев:
    if a!=0:
        print("Решение x="+str(b/a))
    # Ако първият параметър е нула:
    else:
        # Ако вторият параметър е нулев:
        if b!=0:
            print("Няма решение!")
        # Ако и двата параметъра са нулеви:
        else:
            print("Решение - всяко число!")
# Ако параметрите са нечислови:
else:
    print("Въведените стойности са некоректни")
    # Край на изпълнението на програмата:
    raise SystemExit(0)
print("Търсенето на решение приключи.")
