# Оператор за цикъл с истинно условие:
while True:
    # Прочитане на стойността:
    res=input("Въведете естествено число: ")
    # Контролируем код:
    try:
        # Опит за преобразуване в цяло число:
        num=int(res)
        # Ако числото е по-малко от единица:
        if num<1:
            # Текст на съобщението:
            msg="Числото трябва да бъде естествено"
            # Генериране на изключение:
            raise ArithmeticError(msg)
    # Обработка на изключения:
    except ArithmeticError as error:
        print(error)
    except:
        print("Грешка при въвеждане")
    # Ако няма грешка:
    else:
        # Край на оператора за цикъл:
        break
# Изчисление на сумата на естествените числа:
print("Сума от 1 до",num,"=",sum(range(num+1)))
