# Име на файла:
name = "F:\\Book\\Python\\mydata.txt"
# Текст за записване във файл:
txt = "Python"
print("Текст за записване във файла:", txt)
# Файлът се отваря за четене и запис:
mf = open(name, 'w+t')
# Записване на текста във файла:
mf.write(txt)
# Преминаваме в началото на файла:
mf.seek(0)
# Първият символ във файла:
print(mf.tell(), "->", mf.read(1))
# Преминаваме в края на файла:
mf.seek(0, 2)
# Позицията на последния символ във файла:
num = mf.tell() - 1
# Преминаваме в позицията на последния символ:
mf.seek(num)
# Последният символ във файла:
print(mf.tell(), "->", mf.read(1))
# Връщаме се в началото на файла:
mf.seek(0)
# Трите първи символа:
print("Три символа:", mf.read(3))
# Затваряне на файла:
mf.close()
print("Изпълнението на програмата завърши")
