# Създаване на речник:
age=dict([["Котаракът Матроскин",5],["Кучето Шарик",7],["Чичо Фьодор",12]])
# Обхождане на ключовете:
for s in age.keys():
    print(s+":",age[s])
# Обхождане на стойностите:
for v in age.values():
    print(v,end=" ")
print()
# Създаване на речник:
color=dict([[(255,0,0),"Червен"],[(0,255,0),"Зелен"],[(0,0,255),"Син"]])
# Обръщане към елементите на речника:
color[(255,255,0)]="Жълт"
print("(255,0,0):",color[(255,0,0)])
print("(255,255,0):",color[(255,255,0)])
print("(0,255,0):",color.get((0,255,0)))
print("(0,0,255):",color.get((0,0,255),"Бял"))
print("(255,255,255):",color.get((255,255,255),"Бял"))
