# Въвежда се число:
number = int(input("Въведете число: "))
# Горна граница за делителя:
num = number // 2
# Начална стойност за делителя:
k = 2
# Търсене на делителя на числото:
while k <= num:
    # Ако числото се дели на k:
    if number % k == 0:
        print("Числото не е просто")
        # Край на оператора за цикъл:
        break
    # Ако условието е лъжа:
    else:
        # Увеличаване на стойността на делителя:
        k = k + 1
# Блокът се изпълнява, ако не е изпълнена инструкцията 
# break:
else:
    print("Това е просто число")
# Съобщението се показва винаги:
print("Проверката приключи")
